<?php

function numberToArabicText($number) {

    $ones = [
        1 => 'الأولى',
        2 => 'الثانية',
        3 => 'الثالثة',
        4 => 'الرابعة',
        5 => 'الخامسة',
        6 => 'السادسة',
        7 => 'السابعة',
        8 => 'الثامنة',
        9 => 'التاسعة',
        10 => 'العاشرة',
    ];

    if ($number <= 10) {
        return $ones[$number] ?? null;
    }

    return $number . '';
}

function arabicTextToNumber($text) {

    $numbers = [
        'الاول' => 1,
        'الأولى' => 1,
        'الثاني' => 2,
        'الثانية' => 2,
        'الثالث' => 3,
        'الثالثة' => 3,
        'الرابع' => 4,
        'الرابعة' => 4,
        'الخامس' => 5,
        'الخامسة' => 5,
        'السادس' => 6,
        'السادسة' => 6,
        'السابع' => 7,
        'السابعة' => 7,
        'الثامن' => 8,
        'الثامنة' => 8,
        'التاسع' => 9,
        'التاسعة' => 9,
        'العاشر' => 10,
        'العاشرة' => 10,
    ];

    return $numbers[$text] ?? null;
}